In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
# Adding the names of the letters and name
dframe1 = DataFrame(np.arange(8).reshape(2,4),
                    index=pd.Index(['LA','SF'], name='city'),
                    columns=pd.Index(['A','B','C','D'], name='letter'))
dframe1

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [5]:
# Taking the dframe away
dframe_st = dframe1.unstack()
dframe_st

letter  city
A       LA      0
        SF      4
B       LA      1
        SF      5
C       LA      2
        SF      6
D       LA      3
        SF      7
dtype: int64

In [6]:
# Reintroducing it into a dframe
dframe_st.unstack()

city    LA  SF
letter
A        0   4
B        1   5
C        2   6
D        3   7

In [7]:
# Can unstack specfying the following information
dframe_st.unstack('letter')

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [8]:
# Changes the columns with the rows
dframe_st.unstack('city')

city    LA  SF
letter
A        0   4
B        1   5
C        2   6
D        3   7

In [15]:
ser1 = Series([0,1,2], index=['Q','X','Y'])
ser2 = Series([4,5,6], index=['X','Y','Z'])

In [16]:
ser1

Q    0
X    1
Y    2
dtype: int64

In [17]:
ser2

X    4
Y    5
Z    6
dtype: int64

In [18]:
# notices how this is still not a dataframe
dframe = pd.concat([ser1,ser2],keys=['Alpha','Beta'])
dframe

Alpha  Q    0
       X    1
       Y    2
Beta   X    4
       Y    5
       Z    6
dtype: int64

In [19]:
# This method will include null values
dframe.unstack()

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  4.0  5.0  6.0

In [20]:
# This method will not include the null values
dframe.unstack().stack()

Alpha  Q    0.0
       X    1.0
       Y    2.0
Beta   X    4.0
       Y    5.0
       Z    6.0
dtype: float64

In [22]:
dframe = dframe.unstack()
dframe

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  4.0  5.0  6.0

In [24]:
# Noticed how there are no null vals
dframe.stack()

Alpha  Q    0.0
       X    1.0
       Y    2.0
Beta   X    4.0
       Y    5.0
       Z    6.0
dtype: float64

In [25]:
# Noticed how there are null values
dframe.stack(dropna=False)

Alpha  Q    0.0
       X    1.0
       Y    2.0
       Z    NaN
Beta   Q    NaN
       X    4.0
       Y    5.0
       Z    6.0
dtype: float64